results/unused/mickey-bdevperf-ndevs1-01/003_fio/cmd_48.output
io_uring-reference: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=io_uring, iodepth=128
fio-3.32-75-gc470
Starting 1 thread
{
  "fio version" : "fio-3.32-75-gc470",
  "timestamp" : 1667176250,
  "timestamp_ms" : 1667176250481,
  "time" : "Sun Oct 30 19:30:50 2022",
  "jobs" : [
    {
      "jobname" : "io_uring-reference",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring-reference",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "128",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "io_uring",
        "filename" : "/dev/nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 2284692992,
        "io_kbytes" : 2231145,
        "bw_bytes" : 326338093,
        "bw" : 318689,
        "iops" : 637360.805599,
        "runtime" : 7001,
        "total_ios" : 4462163,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 563,
          "max" : 180270,
          "mean" : 1227.093747,
          "stddev" : 463.532058,
          "N" : 4462164
        },
        "clat_ns" : {
          "min" : 9667,
          "max" : 392886,
          "mean" : 199307.918703,
          "stddev" : 1896.024576,
          "N" : 4462290,
          "percentile" : {
            "1.000000" : 193536,
            "5.000000" : 197632,
            "10.000000" : 197632,
            "20.000000" : 197632,
            "30.000000" : 199680,
            "40.000000" : 199680,
            "50.000000" : 199680,
            "60.000000" : 199680,
            "70.000000" : 199680,
            "80.000000" : 199680,
            "90.000000" : 201728,
            "95.000000" : 201728,
            "99.000000" : 201728,
            "99.500000" : 203776,
            "99.900000" : 203776,
            "99.950000" : 205824,
            "99.990000" : 207872
          }
        },
        "lat_ns" : {
          "min" : 10393,
          "max" : 394404,
          "mean" : 200535.011577,
          "stddev" : 1902.103587,
          "N" : 4462290
        },
        "bw_min" : 318464,
        "bw_max" : 319261,
        "bw_agg" : 100.000000,
        "bw_mean" : 318852.692308,
        "bw_dev" : 227.416426,
        "bw_samples" : 13,
        "iops_min" : 636928,
        "iops_max" : 638523,
        "iops_mean" : 637705.538462,
        "iops_stddev" : 455.019343,
        "iops_samples" : 13
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 31.485714,
      "sys_cpu" : 68.528571,
      "ctx" : 20,
      "majf" : 0,
      "minf" : 1,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 100.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999978,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.010000,
        "50" : 0.010000,
        "100" : 0.010000,
        "250" : 99.998700,
        "500" : 0.010000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme0n1",
      "read_ios" : 0,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 0,
      "write_ticks" : 0,
      "in_queue" : 0,
      "util" : 0.000000
    }
  ]
}

io_uring-reference: (groupid=0, jobs=1): err= 0: pid=51081: Sun Oct 30 19:30:50 2022
  read: IOPS=637k, BW=311MiB/s (326MB/s)(2179MiB/7001msec)
    slat (nsec): min=563, max=180270, avg=1227.09, stdev=463.53
    clat (usec): min=9, max=392, avg=199.31, stdev= 1.90
     lat (usec): min=10, max=394, avg=200.54, stdev= 1.90
    clat percentiles (usec):
     |  1.00th=[  194],  5.00th=[  198], 10.00th=[  198], 20.00th=[  198],
     | 30.00th=[  200], 40.00th=[  200], 50.00th=[  200], 60.00th=[  200],
     | 70.00th=[  200], 80.00th=[  200], 90.00th=[  202], 95.00th=[  202],
     | 99.00th=[  202], 99.50th=[  204], 99.90th=[  204], 99.95th=[  206],
     | 99.99th=[  208]
   bw (  KiB/s): min=318464, max=319261, per=100.00%, avg=318852.69, stdev=227.42, samples=13
   iops        : min=636928, max=638523, avg=637705.54, stdev=455.02, samples=13
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=100.00%
  lat (usec)   : 500=0.01%
  cpu          : usr=31.49%, sys=68.53%, ctx=20, majf=0, minf=1
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=4462163,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=311MiB/s (326MB/s), 311MiB/s-311MiB/s (326MB/s-326MB/s), io=2179MiB (2285MB), run=7001-7001msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%